In [1]:
import pandas as pd
import numpy as np
a1 = [60, 84, 80, 70, "문예부"]
a2 = [77, 62, 95, 85, "과학부"]
a3 = [61, 97, 72, np.nan, "농구부"]
a4 = [75, 65, 95, np.nan, "다도부"]
cols = ["국어", "영어", "수학", "과학", "소속"]
b1 = ["문예부", "과학부", "다도부"]
df = pd.DataFrame([a1, a2, a3, a4], index=list("ABCD"), columns=cols)
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

## 불리언덱싱

In [2]:
df["영어"] > 80

A     True
B    False
C     True
D    False
Name: 영어, dtype: bool

In [3]:
df.loc[df["영어"] > 80] # 원하는 A와 C의 정보만 불러옴

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
C  61  97  72   NaN  농구부

In [4]:
df.loc[df["영어"] > 80, "국어": "과학"]

   국어  영어  수학    과학
A  60  84  80  70.0
C  61  97  72   NaN

In [5]:
cond1 = df["영어"] > 80  # 조건문 사용
df.loc[cond1, "국어": "과학"]

   국어  영어  수학    과학
A  60  84  80  70.0
C  61  97  72   NaN

In [7]:
## 국어성적이 60점보다 높으면서 수학성적도 75점보다 높은 학생들의 데이터
## 추출하기

cond1 = df["국어"] > 60
cond2 = df["수학"] > 75
df.loc[cond2 & cond1]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

## ISNULL, ISIN의 함수를 이해한다

In [8]:
# isnull: nan을 true, 아니면 false로 반환하는 함수
df["과학"].isnull()

A    False
B    False
C     True
D     True
Name: 과학, dtype: bool

In [10]:
df.loc[~df["과학"].isnull()] # Nan이 아닌값만 추출

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부

In [11]:
b1

['문예부', '과학부', '다도부']

In [14]:
df["소속"].isin(b1) # b1에 속하면 true, 아니면 false

A     True
B     True
C    False
D     True
Name: 소속, dtype: bool

In [15]:
df.loc[df["소속"].isin(b1)]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부